CSI API ETABS v1
eHingeDistributionType Enumeration
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public enum eHingeDistributionType
Public Enumeration eHingeDistributionType
Dim instance As eHingeDistributionType
public enum class eHingeDistributionType
type eHingeDistributionType
Members
Member name | Value | Description
NonlinearBeamColumn | 1
DistributedPlasticity | 2
EqualSpacing | 3
ContinuousSupport | 4
UserDefined | 5
See Also
Reference
ETABSv1 Namespace